
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 3 to change, 5 to destroy.</code></pre>

* Update
  * azurerm_monitor_metric_alert.storage_final_alert_capacity[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
* Replace
  * azurerm_role_assignment.vm_contributor[0]
  * azurerm_virtual_machine_extension.aad[0]
  * azurerm_virtual_machine_extension.edit_init[0]
  * module.edit_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_monitor_metric_alert.storage_final_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_final_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
        ]
        tags                     = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_role_assignment.vm_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "vm_contributor" {
      ~ id                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod/providers/Microsoft.Authorization/roleAssignments/9677f2f7-1e37-d3f8-41e0-5d8c7cd6c143" -> (known after apply)
      ~ name                                   = "9677f2f7-1e37-d3f8-41e0-5d8c7cd6c143" -> (known after apply)
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> (known after apply)
      ~ scope                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.aad[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "aad" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod/extensions/AADLoginForWindows" -> (known after apply)
        name                        = "AADLoginForWindows"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.edit_init[0] must be replaced
-/+ resource "azurerm_virtual_machine_extension" "edit_init" {
      - auto_upgrade_minor_version  = false -> null
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod/extensions/toolingScript" -> (known after apply)
        name                        = "toolingScript"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ type_handler_version        = "1.10" -> "1.9"
      ~ virtual_machine_id          = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.edit_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["datadisk1"] must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      ~ id                        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod/dataDisks/edit-vm01-data-prod" -> (known after apply)
      ~ virtual_machine_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod" # forces replacement -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0] must be replaced
-/+ resource "azurerm_windows_virtual_machine" "winvm" {
      ~ custom_data                                            = (sensitive value) # forces replacement
      ~ disk_controller_type                                   = "SCSI" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Compute/virtualMachines/edit-vm1-prod" -> (known after apply)
        name                                                   = "edit-vm1-prod"
      ~ private_ip_address                                     = "10.101.3.6" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.101.3.6",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
      ~ virtual_machine_id                                     = "d0d1365c-966c-4a48-a99e-a548ffebdfc1" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (33 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "5bcc6cc7-c00f-4ab8-b87e-aa7a7e45dd33" -> (known after apply)
          ~ tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ os_disk {
          ~ name                             = "edit-vm1-prod_OsDisk_1_fd77ccb927c04baa9c4aab876c1a6ab7" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ termination_notification {
          + admin_password                                         = (known after apply)
          + admin_username                                         = (known after apply)
          + allow_extension_operations                             = (known after apply)
          + availability_set_id                                    = (known after apply)
          + bypass_platform_safety_checks_on_user_schedule_enabled = (known after apply)
          + capacity_reservation_group_id                          = (known after apply)
          + computer_name                                          = (known after apply)
          + custom_data                                            = (known after apply)
          + dedicated_host_group_id                                = (known after apply)
          + dedicated_host_id                                      = (known after apply)
          + disk_controller_type                                   = (known after apply)
          + edge_zone                                              = (known after apply)
          + enable_automatic_updates                               = (known after apply)
          + encryption_at_host_enabled                             = (known after apply)
          + eviction_policy                                        = (known after apply)
          + extensions_time_budget                                 = (known after apply)
          + hotpatching_enabled                                    = (known after apply)
          + id                                                     = (known after apply)
          + license_type                                           = (known after apply)
          + location                                               = (known after apply)
          + max_bid_price                                          = (known after apply)
          + name                                                   = (known after apply)
          + network_interface_ids                                  = (known after apply)
          + patch_assessment_mode                                  = (known after apply)
          + patch_mode                                             = (known after apply)
          + platform_fault_domain                                  = (known after apply)
          + priority                                               = (known after apply)
          + private_ip_address                                     = (known after apply)
          + private_ip_addresses                                   = (known after apply)
          + provision_vm_agent                                     = (known after apply)
          + proximity_placement_group_id                           = (known after apply)
          + public_ip_address                                      = (known after apply)
          + public_ip_addresses                                    = (known after apply)
          + reboot_setting                                         = (known after apply)
          + resource_group_name                                    = (known after apply)
          + secure_boot_enabled                                    = (known after apply)
          + size                                                   = (known after apply)
          + source_image_id                                        = (known after apply)
          + tags                                                   = (known after apply)
          + timezone                                               = (known after apply)
          + user_data                                              = (known after apply)
          + virtual_machine_id                                     = (known after apply)
          + virtual_machine_scale_set_id                           = (known after apply)
          + vm_agent_platform_updates_enabled                      = (known after apply)
          + vtpm_enabled                                           = (known after apply)
          + zone                                                   = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod"
        name                               = "prefinalsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod"
        name                               = "preingestsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 5 to add, 3 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":907,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->